import { Members } from '../types';

const members: Members = [
    {
        name: '宇智波帶土',
        jpName: 'うちはオビト',
        lines: '琳， 我要創造一個有妳的世界',
        profile: [
            {
                title: '年齡',
                description: ['31歲 (已故)'],
            },
            {
                title: '生日',
                description: ['02月13日'],
            },
            {
                title: '血型',
                description: ['O'],
            },
            {
                title: '身高',
                description: ['182 公分'],
            },
            {
                title: '體重',
                description: ['70.3 公斤'],
            },
        ],
        infoContent:
            '帶土是旗木卡卡西、夕日紅、阿凱、野原凜的昔日同窗，不僅和卡卡西與野原凜同為第四代火影波風湊的學生，還曾經是和前兩者攜手度過無數難關的隊友。雖然年少時期在學業及戰鬥方面的表現不甚理想，更一度被卡卡西戲稱為「愛哭忍者」，但還是依靠自己的努力取得中忍證書。由於心地善良被發現其實人不錯，野原凜是少數觀察到此事，並相當關心帶土的存在，因此他對野原凜逐漸產生了暗戀的情愫。後來他在草忍者村的神無毘橋之戰中，為救卡卡西右半身被岩忍使出的岩遁忍術壓住，將一隻寫輪眼贈與卡卡西，之後被岩忍的岩遁忍術活埋（詳情見卡卡西外傳），後因掉到宇智波斑所挖的地道而被其所救，由於右半身被巨石壓爛而被斑縫上了初代火影千手柱間的人造體，在白絕與鳶（漩渦臉人造人）的幫助下康復身體，其中由於鳶頗有個性，因此後來帶土加入曉組織的初期時使用了他的名字，同時模仿他的個性，就連戴的面具都是照著他的臉仿製的。',
        src: './images/members/obito.jpg',
    },
    {
        name: '彌彥',
        jpName: 'やひこ',
        lines: '我要改變國家，保護大家，達到世界頂端',
        profile: [
            {
                title: '年齡',
                description: ['已故'],
            },
            {
                title: '查克拉屬性',
                description: ['火、水、風'],
            },
        ],
        infoContent:
            '在接受自來也的指導時與小南、長門一同待在某棟小屋生活了一段時期。當時四人用自來也設計的門牌卡放在牆架上作為暗號，若是將紅色面朝外表示人在屋子裡，白色面表示本人出去不在。後來彌彥長大後成立了組織，聚集了一群人，可以說是「曉」的前身。由於人數規模變多，為了要尋覓更大的地點作為根據地，三人只得告別和自來也生活時期的小屋。離開前最後一刻，三人聚在門牌卡前，約定在夢想實現的那天，要回到這間小屋與自來也一起慶祝理想的成功。小南首先把自己的門牌卡翻轉，正當彌彥準備翻轉自己的門牌卡時，刺客出現並襲擊三人的所在處，長門、彌彥、小南藉著自來也在小屋設置的秘密通道躲過一劫，長門和彌彥卻從此沒法再回去翻轉自己的門牌卡。鳶為了實現自己的計畫而找上三人，試圖勸說長門歸順。彌彥卻對此頗不以為然，對鳶的態度冷淡，兩人的意見無法合拍。',
        src: './images/members/yahiko.jpg',
    },
    {
        name: '長門 / 培因',
        jpName: 'ながと',
        lines: '從現在開始，讓世界感受痛楚',
        profile: [
            {
                title: '年齡',
                description: ['35歲（已故）'],
            },
            {
                title: '生日',
                description: ['09月19日'],
            },
            {
                title: '血型',
                description: ['A'],
            },
            {
                title: '身高',
                description: ['175.5 公分'],
            },
            {
                title: '體重',
                description: ['40.1 公斤'],
            },
        ],
        infoContent:
            '培因，名字來自於英文「Pain（痛苦）」，其操控的六道特徵是清一色與天道（彌彥）生前相同的橘髮，本體長門則是留著紅長髮，瞳孔有著多重圈狀紋的「輪迴眼」的男子。代表「零葬」的「零」字戒指，佩戴在右手大拇指上。可以瞬間集結所有「曉」之成員，也可召喚用來封印儲存尾獸力量的外道魔像，其強大的封印術，可將尾獸力量從祭品之力體中強行抽出。 六道培因是由長門以查克拉操縱六具屍體組成，視野可以共享。六道培因分別是天道、人間道、修羅道、畜生道、餓鬼道、地獄道，而長門是第七道外道。帶土在奪取長門的輪迴眼時曝出了長門是漩渦一族的後裔並以其紅髮作為佐證，同時帶土亦自稱是賦予長門輪迴眼的斑。而在宇智波帶土的回憶中，宇智波斑透露是自己在長門幼年時將自己的輪迴眼移植給了長門。本名長門取自於伊賀十一達人之一的忍者藤林長門守。',
        src: './images/members/pain.jpg',
    },
    {
        name: '宇智波鼬',
        jpName: 'うちは イタチ',
        lines: '原諒我，佐助，這是最後一次了',
        profile: [
            {
                title: '年齡',
                description: ['第一部 17歲', '第二部 21歲（已故）'],
            },
            {
                title: '生日',
                description: ['06月09日'],
            },
            {
                title: '血型',
                description: ['AB'],
            },
            {
                title: '身高',
                description: ['第一部 175.2 公分', '第二部 178 公分'],
            },
            {
                title: '體重',
                description: ['第一部 57.1 公斤', '第二部 58 公斤'],
            },
        ],
        infoContent:
            '宇智波佐助的兄長，特徵是黑色長髮，從近鼻翼的眼角延伸至眼下的深邃紋路，代表「朱雀」的「朱」字戒指，佩戴在右手無名指上，脖子戴有項鍊。為人沉著冷靜，天資聰穎的他，五歲就將家族基本忍術：「火遁」豪火球之術一學就會，七歲以第一名的成績從忍者學校畢業（六歲入學），八歲時因目睹帶土殺光他的同伴而開啟寫輪眼，十歲晉升為中忍，被稱為「天才忍者」，十三歲就當上暗部分隊長，是家族的驕傲。不料卻突然在一個晚上之內將家族幾乎全滅後，離開木葉成為叛忍，並加入「曉」（實則是為了保護木葉而加入曉作為間諜）。他的弟弟宇智波佐助成為家族中唯一的活口，自始不惜一切以殺死他為目標，為族人復仇。',
        src: './images/members/itachi.jpg',
    },
    {
        name: '小南',
        jpName: 'コナン',
        lines: '我是不畏凋零的花，這就送你上路',
        profile: [
            {
                title: '年齡',
                description: ['35歲（已故）'],
            },
            {
                title: '生日',
                description: ['02月20日'],
            },
            {
                title: '血型',
                description: ['O'],
            },
            {
                title: '身高',
                description: ['169.4 公分'],
            },
            {
                title: '體重',
                description: ['45.3 公斤'],
            },
        ],
        infoContent:
            '小南（Konan）是「曉」中唯一的女性成員，特徵是束成簪狀的藍紫色頭髮，橙色雙眼，頭上佩戴著一朵淡藍色的花型髮飾，下唇刺有一枚唇釘。代表「白虎」的「白」字戒指，配戴在右手中指上。小南的忍術和「紙」有關，是屬於追蹤型及戰鬥型，她是唯一會稱呼培因名字的人。能把紙作為翅膀，具有飛行能力。以「培因」為名的長門稱自己為「神」，小南則以身為神的使者「天使」自居，並排除所有威脅到「神」的人。小南仇視及想要挑戰的人，就是「神」的仇敵以及「神」所恨的人。名字取自於伊賀十一達人之一的忍者神戶小南。',
        src: './images/members/konan.jpg',
    },
    {
        name: '干柿鬼鮫',
        jpName: 'ほしがききさめ',
        lines: '對同伴出手的人，是註定無法善終的',
        profile: [
            {
                title: '年齡',
                description: ['第一部 29歲', '第二部 32-33歲（已故）'],
            },
            {
                title: '生日',
                description: ['9月26日'],
            },
            {
                title: '血型',
                description: ['K'],
            },
            {
                title: '身高',
                description: ['195 公分'],
            },
            {
                title: '體重',
                description: ['95 公斤'],
            },
        ],
        infoContent:
            '原為霧隱「忍刀七人眾」的成員之一，有著跟鮫鯊相像的面孔（兩邊的肩膀處也有鯊魚鰓）、膚色及尖銳的牙齒，金色瞳孔。死前為曉之成員，代表「南斗」的「南」字戒指，佩戴在左手無名指上。鳴人則是以「鯊魚佬」稱呼他。擅長使用水遁以及手上的異狀大刀 「鮫肌」（能吸取查克拉的大刀）進行攻擊，體內亦潛藏了驚人的查克拉量，被七人眾其餘六名成員稱為「沒有尾巴的尾獸」（寧次曾說除了漩渦鳴人外，鬼鮫就是他第二個看見有巨大查克拉的人，因為術的關係這只是干柿鬼鮫30%的查克拉〈象轉術〉，實力高強)，非常尊敬宇智波鼬，甚至會用敬語「鼬先生」，還會關心鼬的身體，在曉之中算是很聽從命令的一個，從不透漏關於自己的事。',
        src: './images/members/kisame.jpg',
    },
    {
        name: '地達羅',
        jpName: 'デイダラ',
        lines: '藝術就是爆炸',
        profile: [
            {
                title: '年齡',
                description: ['19歲（已故）'],
            },
            {
                title: '生日',
                description: ['05月05日'],
            },
            {
                title: '血型',
                description: ['AB'],
            },
            {
                title: '身高',
                description: ['166 公分'],
            },
            {
                title: '體重',
                description: ['50.8 公斤'],
            },
        ],
        infoContent:
            '以前隸屬岩忍者村的爆破部隊，曾是第三代土影的學生，後來地達羅開始渴望村子裡所流傳的禁術，那就是「賦予物質查克拉之術」，雖然觸犯了禁忌，但也透過對追兵放出「引爆黏土」看到他所追求的藝術。其後曉組織的培因看中地達羅的能力，派遣宇智波鼬、蠍及干柿鬼鮫邀請地達羅合作，地達羅因不敵鼬的寫輪眼而加入曉，由於不自覺將鼬的能力認爲是一種藝術，令始終相信自己藝術應該是完美無缺的他感到莫大恥辱，之後為了殺死鼬，長期在左眼集中查克拉訓練使瞳孔縮小來看破寫輪眼的幻術，並發明C4金翅鳥，但最後他在和佐助的對戰中自爆死亡，因此沒能和鼬再次對戰。',
        src: './images/members/deidara.jpg',
    },
    {
        name: '蠍',
        jpName: 'サソリ',
        lines: '我討厭等別人，也不喜歡被別人等',
        profile: [
            {
                title: '年齡',
                description: ['35歲（已故）'],
            },
            {
                title: '生日',
                description: ['11月08日'],
            },
            {
                title: '血型',
                description: ['AB'],
            },
            {
                title: '身高',
                description: ['164.1 公分'],
            },
            {
                title: '體重',
                description: ['47.3 公斤'],
            },
        ],
        infoContent:
            '他是千代婆婆的孫子，也是砂忍者村的叛忍。過去隸屬傀儡部隊，是位天才傀儡師，其傀儡在忍界大戰中將鮮血染遍沙漠，得了赤砂蠍的外號[1]。後來加入「曉」，代表「玉女」的「玉」字戒指佩戴在左手大拇指上。特徵是一頭紅髮，以及被改造成傀儡的身軀，左胸有一個寫蠍字的圓筒狀再生核，是蠍僅存的肉體（心臟），用來製造查克拉，同時也是蠍的弱點，地達羅曾說蠍那暴露出弱點的造型是他對自己太有自信，此外蠍可以任意將再生核附到別的傀儡身上，也可以說他擁有不死之身。平時躲在傀儡外殼「蛭子」裡面。擅長操縱人傀儡攻擊，只有蠍能將人殺死後作成人傀儡，並保有其生前的查克拉屬性加以複製忍術，被他暗殺的第三代風影為得意之作。此外其傀儡和武器都帶有劇毒，只要被傀儡攻擊到任何一處受傷都會中毒，即使是擦傷，中毒者無即時解毒三天必亡。',
        src: './images/members/sasori.jpg',
    },
    {
        name: '飛段',
        jpName: 'ひだん',
        lines: '你會遭到邪神大人的懲罰的',
        profile: [
            {
                title: '年齡',
                description: ['22歲（已被活埋生死未卜）'],
            },
            {
                title: '生日',
                description: ['04月02日'],
            },
            {
                title: '血型',
                description: ['B'],
            },
            {
                title: '身高',
                description: ['178.1 公分'],
            },
            {
                title: '體重',
                description: ['56.8 公斤'],
            },
        ],
        infoContent:
            '擁有不死之身的「邪神教」教徒飛段，出身於有「忘卻戰爭的村子」之稱的湯忍者村。湯忍者村是個隨著戰爭消失而戰鬥力縮減的村子，但也是個有富饒自然資源的村子。忍者出身的飛段十分渴求戰鬥，因此對熱衷和平主義的湯忍者村衍生出焦躁感。所以開始注意了新興宗教「邪神教」，「汝必須殺害周遭的所有人！」這個「邪神教」的教義充滿著肯定飛段的意志。因此飛段殺死了周圍的人，並當上了叛忍。另外，飛段的不死之身並非與生俱來。他是「邪神教」進行禁術實驗的第一個成功案例，飛段的不死之身並非祝福而是詛咒，詛咒的力量隨著殺戮而持續。飛段跟拍檔角都合稱「不死二人組」。',
        src: './images/members/hidan.jpg',
    },
    {
        name: '角都',
        jpName: 'かくず',
        lines: '我想起了最初和我交手的木葉忍者，初代火影',
        profile: [
            {
                title: '年齡',
                description: ['91歲（已故）'],
            },
            {
                title: '查克拉屬性',
                description: ['火、風、雷、水'],
            },
        ],
        infoContent:
            '角都獨自走過漫長的歲月，可以追溯到各國忍者村建立之初。某日，作為瀧忍者村中精英的他接受了高層派下來的任務，任務內容是暗殺火影，因此角都到了木葉和「初代火影」千手柱間戰鬥，不料敗於柱間的木遁秘術之下，一度面臨喪命危機，但後來總算返回村子，然而等待他的是任務失敗的罪名和重罰。角都認為自己為了村子賭上性命卻遭到不平等對待，於是懷著非常強烈的仇恨逃獄，拿走了被村子視為珍寶的禁術，並奪取村內所有高層人士的心臟，而那個禁術就是角都所用的血管觸手——地怨虞。經過了很漫長的時間，角都加入「曉」並成為其成員，擔任「曉」的財務總管，雇了兩名忍者管帳，那兩人在角都死後被蛇小隊（鷹小隊前身）逼問鼬的下落。接到任務的角都飛段勝於火之寺守護忍十二士之一地陸和「二尾」祭品之力－二位柚木斗，接著壓倒鋼小鐵、神月出雲、秋道丁次、山中井野。由於角都殺害了其餘性質變化的忍者並取其心臟，故他能使出五種性質變化的組合忍術，如風遁配上火遁能構成更強大的火遁術，而且不是一般的水遁術所能消滅。第一顆心臟被卡卡西毀掉，第二顆被鹿丸讓飛段的忍術陷害並且誤毀，最終被漩渦鳴人用「風遁·螺旋手裏劍」擊碎全身細胞及兩顆心臟，最後一顆被卡卡西以雷切擊斃，其屍體被帶回木葉。',
        src: './images/members/kakuzu.jpg',
    },
    {
        name: '絕',
        jpName: 'ゼツ',
        lines: '哈哈餵（媽媽）',
        profile: [
            {
                title: '年齡',
                description: ['千歲以上'],
            },
            {
                title: '生日',
                description: ['？'],
            },
            {
                title: '血型',
                description: ['B'],
            },
            {
                title: '身高',
                description: ['177 公分'],
            },
            {
                title: '體重',
                description: ['？'],
            },
        ],
        infoContent:
            '黑絕為六道仙人的母親大筒木輝夜被羽衣與羽村封印前所創造出的孩子，其目的為使自己（輝夜）復活，而白絕則是曾經陷入無限月讀之人最終的下場，輝夜被封印後黑絕做出行動，先是利用因陀羅，後又竄改六道仙人的留下的石碑，並利用宇智波一族替自己賣命，當著宇智波一族的影子。其後宇智波斑用外道魔像培育柱間細胞時，黑絕便讓白絕顯現出來。在第三次忍界大戰草忍者村的神無毘橋之戰後，白絕與鳶（漩渦臉人造人）奉斑的命令監視及幫助宇智波帶土進行康復。曾探查到旗木卡卡西和野原凜在和霧忍的交戰中陷入危機，並帶領帶土前往戰場。後來黑絕透過斑將自己的意識注入白絕殘缺的另一邊，斑在注入完後就斷氣身亡。',
        src: './images/members/zetsu.jpg',
    },
    {
        name: '大蛇丸',
        jpName: 'おろちまる',
        lines: '為死者哀嘆沒有任何意義',
        profile: [
            {
                title: '年齡',
                description: ['第一部 50-51歲', '第二部 54歲'],
            },
            {
                title: '生日',
                description: ['10月27日'],
            },
            {
                title: '血型',
                description: ['B'],
            },
            {
                title: '身高',
                description: ['175 公分'],
            },
            {
                title: '體重',
                description: ['57.4 公斤'],
            },
        ],
        infoContent:
            '本身野心極大，擅長研究忍術並渴望得到寫輪眼。由於目睹了太多人的死亡、知道生命是脆弱的而誤入歧途，他認為人體中藴含着一生都無法使用的力量，因此他想獲得長生不老從而學習所有忍術，掌握世間的真理。其野心被多次粉碎，在佐助與鼬一戰中被鼬的十拳劍封印。後在第四次忍界大戰中，從御手洗紅豆和藥師兜的身上看見了藥師兜的失敗後，想要見證一個完全不同於自己的人生，從而徹底醒悟。之後被佐助復活，穢土轉生前四位火影后，和四位火影、鷹小隊一同前往戰場支援忍者聯軍。',
        src: './images/members/orochimaru.jpg',
    },
];

export default members;
